/*
*********************************************************************************************************
*	                                  
*	模块名称 : 显示驱动
*	文件名称 : gx_display_driver_stm32F4_565rgb.h
*	版    本 : V1.0
*	说    明 : 底层驱动接口文件
*              
*	修改记录 :
*		版本号    日期         作者          说明
*		V1.0    2020-07-05   Eric2013  	    首版    
*                                     
*	Copyright (C), 2020-2030, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/
#ifndef __GX_DISPLAY_DRIVER_STM32H7_565RGB_H
#define __GX_DISPLAY_DRIVER_STM32H7_565RGB_H

#define STM32_SCREEN_HANDLE   0xC0000000

#endif

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
