/*
*********************************************************************************************************
*	                                  
*	模块名称 : GUI界面主函数
*	文件名称 : MainTask.c
*	版    本 : V1.0
*	说    明 : GUI界面主函数
*
*		版本号   日期         作者            说明
*		v1.0    2020-07-06  Eric2013  	    安富莱电子 www.armfly.com
*       V1.1    2020-11-20   HelloByeAll    移植到rt-thrad           
*       V1.2    2020-11-26   HelloByeAll    添加虚拟mono设备
*
*********************************************************************************************************
*/

#ifndef __MainTask_H
#define __MainTask_H
#include "main.h"
#include "gx_user.h"
#include "guiapp_resources.h"
#include "guiapp_specifications.h"
#include "gx_system.h"
#include "gx_display.h"
#include "gx_utility.h"

/*
************************************************************************
*						宏定义
************************************************************************
*/

/*
************************************************************************
*						供外部文件调用
************************************************************************
*/
extern void MainTask(void);

#endif

/*************************************** (END OF FILE) ****************************************/
